Repository: ThallesVicenzo/customizable_chart
Catalog: lib/l10n/app_*.arb
Languages: pt

# appTitle
source: Customizable Chart
pt: Gráfico Customizável

# chartTitle
source: Customizable Chart
pt: Gráfico Customizável

source: Customization Controls
pt: Controles de Customização

source: Colors:
pt: Cores:

source: Thickness:
pt: Espessura:

source: Blue
pt: Azul

source: Red
pt: Vermelho

source: Green
pt: Verde

source: Purple
pt: Roxo

source: Orange
pt: Laranja

source: Add
pt: Adicionar

source: Remove
pt: Remover

source: Reset
pt: Reiniciar

source: Grid
pt: Grade

source: Tooltip
pt: Dica

# week
source: W{number}
pt: S{number}

source: Text Prompts
pt: Prompts de Texto

# promptHint
source: Try: "make it red and bold"
pt: Tente: "deixe vermelho e grosso"

# tryExamples
source: Try these examples:
pt: Experimente estes exemplos:

# promptErrorNotRecognized
source: Error: Prompt not recognized. Try one of the examples.
pt: Erro: Prompt não reconhecido. Tente um dos exemplos.

# promptRedBold
source: make it red and bold
pt: deixe vermelho e grosso

# promptBlueSales
source: show sales data in blue
pt: mostre dados de vendas em azul

# promptMinimalGrid
source: create minimal chart with grid
pt: crie gráfico minimalista com grade

# promptOrangeTrending
source: bright orange trending view
pt: visão laranja vibrante crescente

# promptPurpleThick
source: purple theme with thick lines
pt: tema roxo com linhas grossas

source: Settings
pt: Configurações

source: AI Configuration
pt: Configuração de IA

# aiConfigurationDescription
source: Configure your OpenAI API key to use the intelligent chart personalization functionality.
pt: Configure sua chave da API OpenAI para usar a funcionalidade de personalização inteligente do gráfico.

source: OpenAI API Key
pt: Chave da API OpenAI

source: Edit key
pt: Editar chave

source: Remove key
pt: Remover chave

source: Save Key
pt: Salvar Chave

# pleaseEnterApiKey
source: Please enter an API key
pt: Por favor, insira uma chave da API

# apiKeySavedSuccess
source: API key saved successfully!
pt: Chave da API salva com sucesso!

# errorSavingKey
source: Error saving key: {error}
pt: Erro ao salvar a chave: {error}

# removeApiKeyTitle
source: Remove API Key
pt: Remover Chave da API

# removeApiKeyConfirmation
source: Are you sure you want to remove the API key? You won't be able to use the AI functionality until you configure a new key.
pt: Tem certeza que deseja remover a chave da API? Você não conseguirá usar a funcionalidade de IA até configurar uma nova chave.

source: Cancel
pt: Cancelar

# removeApiKey
source: Remove
pt: Remover

# apiKeyRemovedSuccess
source: API key removed successfully!
pt: Chave da API removida com sucesso!

# howToGetApiKey
source: How to get an OpenAI API key
pt: Como obter uma chave da API OpenAI

# apiKeyStep1
source: 1. Visit: https://platform.openai.com/api-keys
pt: 1. Acesse: https://platform.openai.com/api-keys

# apiKeyStep2
source: 2. Create a free account (if you don't have one)
pt: 2. Crie uma conta gratuita (se não tiver)

# apiKeyStep3
source: 3. Click "Create new secret key"
pt: 3. Clique em "Create new secret key"

# apiKeyStep4
source: 4. Copy the generated key
pt: 4. Copie a chave gerada

# apiKeyStep5
source: 5. Paste it here and click "Save Key"
pt: 5. Cole aqui e clique em "Salvar Chave"

# openaiCreditInfo
source: 💡 OpenAI offers $5 in free credits for new users!
pt: 💡 A OpenAI oferece $5 de crédito gratuito para novos usuários!

source: Configure
pt: Configurar

# aiConfigurationShort
source: AI Configuration
pt: Configuração de IA

# promptErrorApiKeyRequired
source: OpenAI API key not configured
pt: Chave da API OpenAI não configurada

# promptErrorProcessingRequest
source: Error processing request
pt: Erro ao processar solicitação

# promptErrorInvalidCommand
source: Invalid command! I can only help with chart colors and appearance. Try commands like: 'make it blue', 'red background', 'thicker line', or 'hide grid'.
pt: Erro: Comando inválido.

# freeTrialExpired
source: Your free AI trials ({totalUses}) have been used up! To continue using AI functionality: 1. Access app settings 2. Tap "Configure OpenAI API" 3. Enter your API key To get a free key: • Visit: https://platform.openai.com/api-keys • Create an account (if you don't have one) • Generate a new API Key OpenAI offers free credits for new users!
pt: Seu período de teste gratuito expirou.

# freeTrialActive
source: Using free trial mode ({remaining} uses remaining) For unlimited access, configure your OpenAI API key: 1. Access app settings 2. Tap "Configure OpenAI API" 3. Enter your API key To get a free key: • Visit: https://platform.openai.com/api-keys • Create an account (if you don't have one) • Generate a new API Key OpenAI offers free credits for new users!
pt: Teste gratuito ativo.

# authenticationError
source: Authentication error. Please check your API key configuration.
pt: Erro de autenticação. Por favor, verifique sua chave da API.

# apiQuotaExceeded
source: OpenAI API quota exceeded. To continue using AI: 1. Visit: https://platform.openai.com/settings/organization/billing 2. Add a payment method 3. Or wait for the free quota reset Alternatively, you can use the example buttons that work without AI.
pt: Limite de uso da API excedido.

# modelNotAvailable
source: AI model not available. Your OpenAI account may not have access to GPT-3.5. Try using the example buttons that work without AI.
pt: Modelo não disponível.

# unexpectedError
source: Unexpected error: {error} Check your OpenAI API key and try again.
pt: Erro inesperado. Tente novamente.

# unableToInterpretResponse
source: Unable to interpret AI response. Try rephrasing your request.
pt: Não foi possível interpretar a resposta da IA.

# networkError
source: Error connecting to OpenAI API. Check your internet connection and try again.
pt: Erro de rede. Verifique sua conexão.

# personalApiKeyActive
source: Using your personal API key - unlimited access
pt: Chave da API pessoal ativa.

# freeTrialRemaining
source: Free trial: {remaining} uses remaining
pt: Dias restantes no teste gratuito: {remaining}

# freeTrialExpiredStatus
source: Free trial expired - configure your API key for unlimited access
pt: Status: Teste gratuito expirado.
